bernabeu-a/trampoline/examples/cortex/armv7em/efm32wg/audiomoth/yellow_hammer_audiomoth_test/main.c
	/* Setup PRS (Peripheral Reflex System) between Timer and ADC */
	CMU_ClockEnable(cmuClock_PRS, true);
	CMU_ClockEnable(cmuClock_TIMER2, true);
	/* Connect PRS channel 0 to TIMER overflow */
	PRS_SourceSignalSet(0, PRS_CH_CTRL_SOURCESEL_TIMER2, PRS_CH_CTRL_SIGSEL_TIMER2OF, prsEdgeOff);
	/* Enable TIMER with default settings */
	TIMER_Init_TypeDef timerInit = TIMER_INIT_DEFAULT;
	timerInit.enable = false;
	TIMER_Init(TIMER2, &timerInit);
	/* Configure TIMER to trigger on sampling rate */
	TIMER_TopSet(TIMER2,  CMU_ClockFreqGet(cmuClock_TIMER2) / 20480 - 1);
	/* Enable Timer on ADC */
	TIMER_Enable(TIMER2, true);
	/* Start ADC sample */
	ADC_Start(ADC0, adcStartSingle);
	TerminateTask();
}
#define APP_Task_start_dma_STOP_SEC_CODE
#include "tpl_memmap.h"


#define APP_Task_copyDMAtoSRAM_START_SEC_CODE
#include "tpl_memmap.h"

// P2VAR(int16_t, AUTOMATIC, OS_VAR) buffer_sram;
// VAR(float, AUTOMATIC) buffer_float_sound [1024] = {0.0f};

VAR(uint8_t,AUTOMATIC) count_env = 0;
// VAR(uint8_t, AUTOMATIC) count_env_test = 0;
/* EBI region 0 */
#define SRAM_EXT_START_ADDR 	0x80000000

#define SRAM_EXT_START_ADDR_1 	0x80001000
#define SRAM_EXT_START_ADDR_2 	0x80002000
#define SRAM_EXT_START_ADDR_3 	0x80003000
#define SRAM_EXT_START_ADDR_4 	0x80004000
#define SRAM_EXT_START_ADDR_5 	0x80005000
#define SRAM_EXT_START_ADDR_6 	0x80006000
#define SRAM_EXT_START_ADDR_7 	0x80007000
#define SRAM_EXT_START_ADDR_8 	0x80008000
#define SRAM_EXT_START_ADDR_9 	0x80009000
#define SRAM_EXT_START_ADDR_10 	0x8000A000
#define SRAM_EXT_START_ADDR_11 	0x8000B000
#define SRAM_EXT_START_ADDR_12 	0x8000C000
#define SRAM_EXT_START_ADDR_13 	0x8000D000
#define SRAM_EXT_START_ADDR_14 	0x8000E000
#define SRAM_EXT_START_ADDR_15 	0x8000F000
#define SRAM_EXT_START_ADDR_16 	0x80010000
#define SRAM_EXT_START_ADDR_17 	0x80011000
#define SRAM_EXT_START_ADDR_18 	0x80012000
#define SRAM_EXT_START_ADDR_19 	0x80013000
#define SRAM_EXT_START_ADDR_20 	0x80014000

#define SRAM_EXT_START_ADDR_1_2 	0x80101000
#define SRAM_EXT_START_ADDR_2_2 	0x80102000
#define SRAM_EXT_START_ADDR_3_2 	0x80103000
#define SRAM_EXT_START_ADDR_4_2 	0x80104000
#define SRAM_EXT_START_ADDR_5_2 	0x80105000
#define SRAM_EXT_START_ADDR_6_2 	0x80106000
#define SRAM_EXT_START_ADDR_7_2 	0x80107000
#define SRAM_EXT_START_ADDR_8_2 	0x80108000
#define SRAM_EXT_START_ADDR_9_2 	0x80109000
#define SRAM_EXT_START_ADDR_10_2 	0x8010A000
#define SRAM_EXT_START_ADDR_11_2 	0x8010B000
#define SRAM_EXT_START_ADDR_12_2 	0x8010C000
#define SRAM_EXT_START_ADDR_13_2 	0x8010D000
#define SRAM_EXT_START_ADDR_14_2 	0x8010E000
#define SRAM_EXT_START_ADDR_15_2 	0x8010F000
#define SRAM_EXT_START_ADDR_16_2 	0x80110000
#define SRAM_EXT_START_ADDR_17_2 	0x80111000
#define SRAM_EXT_START_ADDR_18_2 	0x80112000
#define SRAM_EXT_START_ADDR_19_2 	0x80113000
#define SRAM_EXT_START_ADDR_20_2 	0x80114000

#define SRAM_EXT_START_ADDR_1_3 	0x80115000
#define SRAM_EXT_START_ADDR_2_3 	0x80116000
#define SRAM_EXT_START_ADDR_3_3 	0x80117000
#define SRAM_EXT_START_ADDR_4_3 	0x80118000
#define SRAM_EXT_START_ADDR_5_3 	0x80119000
#define SRAM_EXT_START_ADDR_6_3 	0x8011A000
#define SRAM_EXT_START_ADDR_7_3 	0x8011B000
#define SRAM_EXT_START_ADDR_8_3 	0x8011C000
#define SRAM_EXT_START_ADDR_9_3 	0x8011D000
#define SRAM_EXT_START_ADDR_10_3 	0x8011E000
#define SRAM_EXT_START_ADDR_11_3 	0x8011F000
#define SRAM_EXT_START_ADDR_12_3 	0x80120000
#define SRAM_EXT_START_ADDR_13_3 	0x80121000
#define SRAM_EXT_START_ADDR_14_3 	0x80122000
#define SRAM_EXT_START_ADDR_15_3 	0x80123000
#define SRAM_EXT_START_ADDR_16_3 	0x80124000
#define SRAM_EXT_START_ADDR_17_3 	0x80125000
#define SRAM_EXT_START_ADDR_18_3 	0x80126000
#define SRAM_EXT_START_ADDR_19_3 	0x80127000
#define SRAM_EXT_START_ADDR_20_3 	0x80128000

#define SRAM_EXT_START_ADDR_1_4 	0x80129000
#define SRAM_EXT_START_ADDR_2_4 	0x8012A000
#define SRAM_EXT_START_ADDR_3_4 	0x8012B000
#define SRAM_EXT_START_ADDR_4_4 	0x8012C000
#define SRAM_EXT_START_ADDR_5_4 	0x8012D000
#define SRAM_EXT_START_ADDR_6_4 	0x8012E000
#define SRAM_EXT_START_ADDR_7_4 	0x8012F000
#define SRAM_EXT_START_ADDR_8_4 	0x80130000
#define SRAM_EXT_START_ADDR_9_4 	0x80131000
#define SRAM_EXT_START_ADDR_10_4 	0x80132000
#define SRAM_EXT_START_ADDR_11_4 	0x80133000
#define SRAM_EXT_START_ADDR_12_4 	0x80134000
#define SRAM_EXT_START_ADDR_13_4 	0x80135000
#define SRAM_EXT_START_ADDR_14_4 	0x80136000
#define SRAM_EXT_START_ADDR_15_4 	0x80137000
#define SRAM_EXT_START_ADDR_16_4 	0x80138000
#define SRAM_EXT_START_ADDR_17_4 	0x80139000
#define SRAM_EXT_START_ADDR_18_4 	0x8013A000
#define SRAM_EXT_START_ADDR_19_4 	0x8013B000
#define SRAM_EXT_START_ADDR_20_4 	0x8013C000

/* We have 2 buffer of 1024 int16 in SRAM EXT --> START AT + 0x800 */
#define SRAM_EXT_START_FILTERED_PING_BAND1_ADDR 	0x80015000
/* + 1024 FLOAT --> + 4*1024 BYTES */
#define SRAM_EXT_START_FILTERED_PONG_BAND1_ADDR 	0x80016000
#define SRAM_EXT_START_FILTERED_PING_BAND1_ADDR_BIS 0x80017000

#define SRAM_EXT_START_FILTERED_PING_BAND2_ADDR 	0x80018000
#define SRAM_EXT_START_FILTERED_PONG_BAND2_ADDR 	0x80019000
#define SRAM_EXT_START_FILTERED_PING_BAND2_ADDR_BIS 0x8001A000

#define SRAM_EXT_START_FILTERED_PING_BAND3_ADDR 	0x8001B000
#define SRAM_EXT_START_FILTERED_PONG_BAND3_ADDR 	0x8001C000
#define SRAM_EXT_START_FILTERED_PING_BAND3_ADDR_BIS 0x8001D000

#define SRAM_EXT_PING_ENVELOPE1						0x80020000
#define SRAM_EXT_PING_ENVELOPE2						0x80021000
#define SRAM_EXT_PING_ENVELOPE3						0x80022000

#define SRAM_EXT_PONG_ENVELOPE1						0x80023000
#define SRAM_EXT_PONG_ENVELOPE2						0x80024000
#define SRAM_EXT_PONG_ENVELOPE3						0x80025000

#define SRAM_FILTERED_AUDIO_PING_1					0x80026000 /* Size is A000 */
#define SRAM_FILTERED_AUDIO_PING_2					0x80030000 /* Size is A000 */
#define SRAM_FILTERED_AUDIO_PING_3					0x8003A000 /* Size is A000 */

#define SRAM_FILTERED_AUDIO_PONG_1					0x80044000 /* Size is A000 */
#define SRAM_FILTERED_AUDIO_PONG_2					0x8004E000 /* Size is A000 */
#define SRAM_FILTERED_AUDIO_PONG_3					0x80058000 /* Size is A000 */

float32_t *buffer_float_sram;
float32_t *prev_ping_buffer_filtered_band1;
float32_t *prev_pong_buffer_filtered_band1;
// float32_t *prev_ping_buffer_filtered_band1_bis;

float32_t *prev_ping_buffer_filtered_band2;
float32_t *prev_pong_buffer_filtered_band2;
// float32_t *prev_ping_buffer_filtered_band2_bis;

