bernabeu-a/trampoline/examples/cortex/armv7em/efm32wg/audiomoth/yellow_hammer_audiomoth_test/main.c
float32_t *prev_ping_buffer_filtered_band3;
float32_t *prev_pong_buffer_filtered_band3;
// float32_t *prev_ping_buffer_filtered_band3_bis;

/* Number of 2nd order stage in filter, order is 2*numStagesIIR */
const uint32_t numStagesIIR = 3;

static float32_t firStateF32_band1 [2*3] = {0};
static float32_t firStateF32_band2 [2*3] = {0};
static float32_t firStateF32_band3 [2*3] = {0};

#ifdef PRE_PROCESSING_MAX
// static float32_t firStateF32_low1 [2*2] = {0};
// static float32_t firStateF32_low2 [2*2] = {0};
// static float32_t firStateF32_low3 [2*2] = {0};
#endif

P2VAR(float32_t, AUTOMATIC, AUTOMATIC) ptr_SRAM_FILTERED_AUDIO_PING_1 = (float32_t *) SRAM_FILTERED_AUDIO_PING_1;
P2VAR(float32_t, AUTOMATIC, AUTOMATIC) ptr_SRAM_FILTERED_AUDIO_PING_2 = (float32_t *) SRAM_FILTERED_AUDIO_PING_2;
P2VAR(float32_t, AUTOMATIC, AUTOMATIC) ptr_SRAM_FILTERED_AUDIO_PING_3 = (float32_t *) SRAM_FILTERED_AUDIO_PING_3;

P2VAR(float32_t, AUTOMATIC, AUTOMATIC) ptr_SRAM_FILTERED_AUDIO_PONG_1 = (float32_t *) SRAM_FILTERED_AUDIO_PONG_1;
P2VAR(float32_t, AUTOMATIC, AUTOMATIC) ptr_SRAM_FILTERED_AUDIO_PONG_2 = (float32_t *) SRAM_FILTERED_AUDIO_PONG_2;
P2VAR(float32_t, AUTOMATIC, AUTOMATIC) ptr_SRAM_FILTERED_AUDIO_PONG_3 = (float32_t *) SRAM_FILTERED_AUDIO_PONG_3;

P2VAR(int16_t, AUTOMATIC, OS_APPL_DATA) buffer_ptr_sram[60] = {
	(int16_t *) SRAM_EXT_START_ADDR_1,
	(int16_t *) SRAM_EXT_START_ADDR_2,
	(int16_t *) SRAM_EXT_START_ADDR_3,
	(int16_t *) SRAM_EXT_START_ADDR_4,
	(int16_t *) SRAM_EXT_START_ADDR_5,
	(int16_t *) SRAM_EXT_START_ADDR_6,
	(int16_t *) SRAM_EXT_START_ADDR_7,
	(int16_t *) SRAM_EXT_START_ADDR_8,
	(int16_t *) SRAM_EXT_START_ADDR_9,
	(int16_t *) SRAM_EXT_START_ADDR_10,
	(int16_t *) SRAM_EXT_START_ADDR_11,
	(int16_t *) SRAM_EXT_START_ADDR_12,
	(int16_t *) SRAM_EXT_START_ADDR_13,
	(int16_t *) SRAM_EXT_START_ADDR_14,
	(int16_t *) SRAM_EXT_START_ADDR_15,
	(int16_t *) SRAM_EXT_START_ADDR_16,
	(int16_t *) SRAM_EXT_START_ADDR_17,
	(int16_t *) SRAM_EXT_START_ADDR_18,
	(int16_t *) SRAM_EXT_START_ADDR_19,
	(int16_t *) SRAM_EXT_START_ADDR_20,
	(int16_t *) SRAM_EXT_START_ADDR_1_3,
	(int16_t *) SRAM_EXT_START_ADDR_2_3,
	(int16_t *) SRAM_EXT_START_ADDR_3_3,
	(int16_t *) SRAM_EXT_START_ADDR_4_3,
	(int16_t *) SRAM_EXT_START_ADDR_5_3,
	(int16_t *) SRAM_EXT_START_ADDR_6_3,
	(int16_t *) SRAM_EXT_START_ADDR_7_3,
	(int16_t *) SRAM_EXT_START_ADDR_8_3,
	(int16_t *) SRAM_EXT_START_ADDR_9_3,
	(int16_t *) SRAM_EXT_START_ADDR_10_3,
	(int16_t *) SRAM_EXT_START_ADDR_11_3,
	(int16_t *) SRAM_EXT_START_ADDR_12_3,
	(int16_t *) SRAM_EXT_START_ADDR_13_3,
	(int16_t *) SRAM_EXT_START_ADDR_14_3,
	(int16_t *) SRAM_EXT_START_ADDR_15_3,
	(int16_t *) SRAM_EXT_START_ADDR_16_3,
	(int16_t *) SRAM_EXT_START_ADDR_17_3,
	(int16_t *) SRAM_EXT_START_ADDR_18_3,
	(int16_t *) SRAM_EXT_START_ADDR_19_3,
	(int16_t *) SRAM_EXT_START_ADDR_20_3,
	(int16_t *) SRAM_EXT_START_ADDR_1_4,
	(int16_t *) SRAM_EXT_START_ADDR_2_4,
	(int16_t *) SRAM_EXT_START_ADDR_3_4,
	(int16_t *) SRAM_EXT_START_ADDR_4_4,
	(int16_t *) SRAM_EXT_START_ADDR_5_4,
	(int16_t *) SRAM_EXT_START_ADDR_6_4,
	(int16_t *) SRAM_EXT_START_ADDR_7_4,
	(int16_t *) SRAM_EXT_START_ADDR_8_4,
	(int16_t *) SRAM_EXT_START_ADDR_9_4,
	(int16_t *) SRAM_EXT_START_ADDR_10_4,
	(int16_t *) SRAM_EXT_START_ADDR_11_4,
	(int16_t *) SRAM_EXT_START_ADDR_12_4,
	(int16_t *) SRAM_EXT_START_ADDR_13_4,
	(int16_t *) SRAM_EXT_START_ADDR_14_4,
	(int16_t *) SRAM_EXT_START_ADDR_15_4,
	(int16_t *) SRAM_EXT_START_ADDR_16_4,
	(int16_t *) SRAM_EXT_START_ADDR_17_4,
	(int16_t *) SRAM_EXT_START_ADDR_18_4,
	(int16_t *) SRAM_EXT_START_ADDR_19_4,
	(int16_t *) SRAM_EXT_START_ADDR_20_4
};

P2VAR(int16_t, AUTOMATIC, OS_APPL_DATA) buffer_ptr_sram2[20] = {
	(int16_t *) SRAM_EXT_START_ADDR_1_2,
	(int16_t *) SRAM_EXT_START_ADDR_2_2,
	(int16_t *) SRAM_EXT_START_ADDR_3_2,
	(int16_t *) SRAM_EXT_START_ADDR_4_2,
	(int16_t *) SRAM_EXT_START_ADDR_5_2,
	(int16_t *) SRAM_EXT_START_ADDR_6_2,
	(int16_t *) SRAM_EXT_START_ADDR_7_2,
	(int16_t *) SRAM_EXT_START_ADDR_8_2,
	(int16_t *) SRAM_EXT_START_ADDR_9_2,
	(int16_t *) SRAM_EXT_START_ADDR_10_2,
	(int16_t *) SRAM_EXT_START_ADDR_11_2,
	(int16_t *) SRAM_EXT_START_ADDR_12_2,
	(int16_t *) SRAM_EXT_START_ADDR_13_2,
	(int16_t *) SRAM_EXT_START_ADDR_14_2,
	(int16_t *) SRAM_EXT_START_ADDR_15_2,
	(int16_t *) SRAM_EXT_START_ADDR_16_2,
	(int16_t *) SRAM_EXT_START_ADDR_17_2,
	(int16_t *) SRAM_EXT_START_ADDR_18_2,
	(int16_t *) SRAM_EXT_START_ADDR_19_2,
	(int16_t *) SRAM_EXT_START_ADDR_20_2
};

VAR(uint8_t, AUTOMATIC) count_ptr_buffer = 0;

VAR(uint8_t, AUTOMATIC) is_writting_audio = 0;

VAR(uint8_t, AUTOMATIC) sram_ping_rdy = 0;

VAR(float32_t, AUTOMATIC) max_pool_for_low_pass1 [80] = {0};
P2VAR(uint32_t, AUTOMATIC, AUTOMATIC) indexMax1;
VAR(float32_t, AUTOMATIC) max_pool_for_low_pass2 [80] = {0};
P2VAR(uint32_t, AUTOMATIC, AUTOMATIC) indexMax2;
VAR(float32_t, AUTOMATIC) max_pool_for_low_pass3 [80] = {0};
P2VAR(uint32_t, AUTOMATIC, AUTOMATIC) indexMax3;

VAR(uint8_t, AUTOMATIC) index_buffer_audio_to_write = 0;
// VAR(uint8_t, AUTOMATIC) init_filter = 1;

VAR(uint8_t, AUTOMATIC) index_buffer_audio_inference = 0;
VAR(uint8_t, AUTOMATIC) index_buffer_audio_inference2 = 0;

TASK(copyDMAtoSRAM){
	// GPIO->P[gpioPortA].DOUT ^= 1<<7;
	/* Wait for event to transfer audio to sram */
	EventMaskType ev;
	WaitEvent(ev_DMAtoSRAM);
	GetEvent(copyDMAtoSRAM, &ev);
	ClearEvent(ev);
	GPIO->P[gpioPortB].DOUT |= 1<<9;

	/* We have 20 buffer of sound ie --> 1s of sound */
	// static uint8_t count_ptr_buffer = 0;

	int16_t *buffer_dma;
	if(isPrimaryDMABuffer){
		buffer_dma = secondaryBuffer;
	}
	else{
		buffer_dma = primaryBuffer;
	}

	buffer_float_sram = (float32_t *) SRAM_EXT_START_ADDR;
	int16_t *tmp_data_buffer_ptr_sram = buffer_ptr_sram[count_ptr_buffer];
	for(uint16_t i = 0; i < 1024; i++){
		// *buffer_ptr_sram[count_ptr_buffer]++ = *buffer_dma++;
		*tmp_data_buffer_ptr_sram++ = *buffer_dma++;
	}
	
	if(is_writting_audio){
		count_env = 0;
		int16_t *tmp_data_buffer_ptr_sram2 = buffer_ptr_sram2[index_buffer_audio_to_write];
		for(uint16_t i = 0; i < 1024; i++){
			*tmp_data_buffer_ptr_sram2++ = buffer_ptr_sram[count_ptr_buffer][i];
		}
		index_buffer_audio_to_write++;
		count_ptr_buffer++;
		if(count_ptr_buffer == 60) count_ptr_buffer = 0;
		if(index_buffer_audio_to_write == 20) index_buffer_audio_to_write = 0;
		// int16_t *tmp_data_for_writing = buffer_ptr_sram_writing[count_buffer_ptr]
		GPIO->P[gpioPortB].DOUT &= ~(1<<9);
		SetEvent(write_audio, ev_write_audio);
		ChainTask(copyDMAtoSRAM);
	}
	// buffer_sram = (int16_t *) SRAM_EXT_START_ADDR;
	// float32_t *input_float_test = data_input;
	// static float32_t filtered_rms_band1 [1024];
	arm_biquad_cascade_df2T_instance_f32 instFilter1;
	arm_biquad_cascade_df2T_instance_f32 instFilter2;
	arm_biquad_cascade_df2T_instance_f32 instFilter3;

