bernabeu-a/trampoline/examples/cortex/armv7em/efm32wg/audiomoth/yellow_hammer_audiomoth_test/main.c
	arm_biquad_cascade_df2T_init_f32(&instFilter1, numStagesIIR, &firCoefF32_band1[0], &firStateF32_band1[0]);
	arm_biquad_cascade_df2T_init_f32(&instFilter2, numStagesIIR, &firCoefF32_band2[0], &firStateF32_band2[0]);
	arm_biquad_cascade_df2T_init_f32(&instFilter3, numStagesIIR, &firCoefF32_band3[0], &firStateF32_band3[0]);

	prev_ping_buffer_filtered_band1 = (float32_t *) SRAM_EXT_START_FILTERED_PING_BAND1_ADDR;
	prev_pong_buffer_filtered_band1 = (float32_t *) SRAM_EXT_START_FILTERED_PONG_BAND1_ADDR;
	// prev_ping_buffer_filtered_band1_bis = (float32_t *) SRAM_EXT_START_FILTERED_PING_BAND1_ADDR_BIS;

	prev_ping_buffer_filtered_band2 = (float32_t *) SRAM_EXT_START_FILTERED_PING_BAND2_ADDR;
	prev_pong_buffer_filtered_band2 = (float32_t *) SRAM_EXT_START_FILTERED_PONG_BAND2_ADDR;
	// prev_ping_buffer_filtered_band2_bis = (float32_t *) SRAM_EXT_START_FILTERED_PING_BAND2_ADDR_BIS;

	prev_ping_buffer_filtered_band3 = (float32_t *) SRAM_EXT_START_FILTERED_PING_BAND3_ADDR;
	prev_pong_buffer_filtered_band3 = (float32_t *) SRAM_EXT_START_FILTERED_PONG_BAND3_ADDR;
	// prev_ping_buffer_filtered_band3_bis = (float32_t *) SRAM_EXT_START_FILTERED_PING_BAND3_ADDR_BIS;

	ping_ptr_envelope1 = (float32_t *) SRAM_EXT_PING_ENVELOPE1;
	ping_ptr_envelope2 = (float32_t *) SRAM_EXT_PING_ENVELOPE2;
	ping_ptr_envelope3 = (float32_t *) SRAM_EXT_PING_ENVELOPE3;

	pong_ptr_envelope1 = (float32_t *) SRAM_EXT_PONG_ENVELOPE1;
	pong_ptr_envelope2 = (float32_t *) SRAM_EXT_PONG_ENVELOPE2;
	pong_ptr_envelope3 = (float32_t *) SRAM_EXT_PONG_ENVELOPE3;

	
	
	// float *tmp_ptr_envelope1;
	// float *tmp_ptr_envelope2;
	// float *tmp_ptr_envelope3;

	// if(envelop_ping_rdy){
	// 	tmp_ptr_envelope1 = pong_ptr_envelope1;
	// 	tmp_ptr_envelope2 = pong_ptr_envelope2;
	// 	tmp_ptr_envelope3 = pong_ptr_envelope3;
	// }
	// else{
	// 	tmp_ptr_envelope1 = ping_ptr_envelope1;
	// 	tmp_ptr_envelope2 = ping_ptr_envelope2;
	// 	tmp_ptr_envelope3 = ping_ptr_envelope3;
	// }

#ifdef PRE_PROCESSING_RMS 
	float32_t result_rms;
	float32_t *ptr_result_rms = &result_rms;
#endif
#ifdef PRE_PROCESSING_MAX
	float32_t *maxpool_1;
	float32_t *maxpool_2;
	float32_t *maxpool_3;

	// arm_biquad_cascade_df2T_instance_f32 instFilter_low1;
	// arm_biquad_cascade_df2T_instance_f32 instFilter_low2;
	// arm_biquad_cascade_df2T_instance_f32 instFilter_low3;

	// if(init_filter){
		// GPIO->P[gpioPortB].DOUT ^= (1<<9);
		// arm_biquad_cascade_df2T_init_f32(&instFilter_low1, 2, &firCoefF32_low[0], &firStateF32_low1[0]);
		// arm_biquad_cascade_df2T_init_f32(&instFilter_low2, 2, &firCoefF32_low[0], &firStateF32_low2[0]);
		// arm_biquad_cascade_df2T_init_f32(&instFilter_low3, 2, &firCoefF32_low[0], &firStateF32_low3[0]);
		// GPIO->P[gpioPortB].DOUT ^= (1<<9);
	// 	init_filter = 0;
	// }

	/* 16 bit PCM to float for pre-processing */
	// GPIO->P[gpioPortB].DOUT ^= (1<<9);
	arm_q15_to_float(buffer_ptr_sram[count_ptr_buffer], buffer_float_sram, 1024);
	// GPIO->P[gpioPortB].DOUT ^= (1<<9);
#endif
	if(isPrimaryDMABuffer){
		// arm_biquad_cascade_df2T_f32(&instFilter1, buffer_float_sound, prev_pong_buffer_filtered_band1, 1024);
		// arm_biquad_cascade_df2T_f32(&instFilter2, buffer_float_sound, prev_pong_buffer_filtered_band2, 1024);
		// arm_biquad_cascade_df2T_f32(&instFilter3, buffer_float_sound, prev_pong_buffer_filtered_band3, 1024);
		// GPIO->P[gpioPortB].DOUT ^= (1<<9);
		arm_biquad_cascade_df2T_f32(&instFilter1, buffer_float_sram, prev_ping_buffer_filtered_band1, 1024);
		arm_biquad_cascade_df2T_f32(&instFilter2, buffer_float_sram, prev_ping_buffer_filtered_band2, 1024);
		arm_biquad_cascade_df2T_f32(&instFilter3, buffer_float_sram, prev_ping_buffer_filtered_band3, 1024);
		// GPIO->P[gpioPortB].DOUT ^= (1<<9);
#ifdef WITH_MAX_NOT_IN_INFERENCE
#ifdef PRE_PROCESSING_MAX
// GPIO->P[gpioPortB].DOUT ^= (1<<9);
			arm_abs_f32 (prev_ping_buffer_filtered_band1, prev_ping_buffer_filtered_band1, 1024);
			arm_abs_f32 (prev_ping_buffer_filtered_band2, prev_ping_buffer_filtered_band2, 1024);
			arm_abs_f32 (prev_ping_buffer_filtered_band3, prev_ping_buffer_filtered_band3, 1024);
// GPIO->P[gpioPortB].DOUT ^= (1<<9);
#endif
		for(uint8_t i = 0; i < 8; i++){	
#ifdef PRE_PROCESSING_RMS 
			/* RMS on previous and current buffer with hop length of 128 */
			arm_rms_f32(prev_ping_buffer_filtered_band1+(128*i), 1024, ptr_result_rms);
			*tmp_ptr_envelope1++ = result_rms;
			// envelope_1[count_env] = result_rms;
			arm_rms_f32(prev_ping_buffer_filtered_band2+(128*i), 1024, ptr_result_rms);
			*tmp_ptr_envelope2++ = result_rms;
			// envelope_2[count_env] = result_rms;
			arm_rms_f32(prev_ping_buffer_filtered_band3+(128*i), 1024, ptr_result_rms);
			*tmp_ptr_envelope3++ = result_rms;
			// envelope_3[count_env] = result_rms;
#endif
#ifdef PRE_PROCESSING_MAX
			// GPIO->P[gpioPortB].DOUT ^= (1<<9);
			arm_max_f32(prev_ping_buffer_filtered_band1+(128*i), 128, max_pool_for_low_pass1+count_env, indexMax1);
			arm_max_f32(prev_ping_buffer_filtered_band2+(128*i), 128, max_pool_for_low_pass2+count_env, indexMax2);
			arm_max_f32(prev_ping_buffer_filtered_band3+(128*i), 128, max_pool_for_low_pass3+count_env, indexMax3);
			// GPIO->P[gpioPortB].DOUT ^= (1<<9);

#endif
			count_env++;
			if(count_env >= 80) {
#ifdef PRE_PROCESSING_MAX
				arm_biquad_cascade_df2T_f32(&instFilter_low1, max_pool_for_low_pass1, tmp_ptr_envelope1, 80);
				arm_biquad_cascade_df2T_f32(&instFilter_low2, max_pool_for_low_pass2, tmp_ptr_envelope2, 80);
				arm_biquad_cascade_df2T_f32(&instFilter_low3, max_pool_for_low_pass3, tmp_ptr_envelope3, 80);
#endif
				envelop_ping_rdy ^= true;
				count_env = 0;
				SetEvent(inference, ev_NORMALIZE);
			}		
		}
#endif
		if(sram_ping_rdy){
			arm_abs_f32 (prev_ping_buffer_filtered_band1, ptr_SRAM_FILTERED_AUDIO_PING_1+(count_env*1024), 1024);
			arm_abs_f32 (prev_ping_buffer_filtered_band2, ptr_SRAM_FILTERED_AUDIO_PING_2+(count_env*1024), 1024);
			arm_abs_f32 (prev_ping_buffer_filtered_band3, ptr_SRAM_FILTERED_AUDIO_PING_3+(count_env*1024), 1024);
			count_env++;
			if(count_env >= 10){
				index_buffer_audio_inference = count_ptr_buffer;
				count_env = 0;
				// sram_ping_rdy = true;
				SetEvent(inference, ev_NORMALIZE);
			}
		}
		else{
			arm_abs_f32 (prev_ping_buffer_filtered_band1, ptr_SRAM_FILTERED_AUDIO_PONG_1+(count_env*1024), 1024);
			arm_abs_f32 (prev_ping_buffer_filtered_band2, ptr_SRAM_FILTERED_AUDIO_PONG_2+(count_env*1024), 1024);
			arm_abs_f32 (prev_ping_buffer_filtered_band3, ptr_SRAM_FILTERED_AUDIO_PONG_3+(count_env*1024), 1024);
			count_env++;
			if(count_env >= 10){
				index_buffer_audio_inference = count_ptr_buffer;
				count_env = 0;
				// sram_ping_rdy = false;
				SetEvent(inference, ev_NORMALIZE);
			}
		}
		
