bernabeu-a/trampoline/examples/cortex/armv7em/efm32wg/audiomoth/yellow_hammer_audiomoth_test/main.c
	}
	else{
		// arm_biquad_cascade_df2T_f32(&instFilter1, buffer_float_sound, prev_ping_buffer_filtered_band1, 1024);
		// arm_biquad_cascade_df2T_f32(&instFilter2, buffer_float_sound, prev_ping_buffer_filtered_band2, 1024);
		// arm_biquad_cascade_df2T_f32(&instFilter3, buffer_float_sound, prev_ping_buffer_filtered_band3, 1024);
		// GPIO->P[gpioPortB].DOUT ^= (1<<9);
		arm_biquad_cascade_df2T_f32(&instFilter1, buffer_float_sram, prev_pong_buffer_filtered_band1, 1024);
		arm_biquad_cascade_df2T_f32(&instFilter2, buffer_float_sram, prev_pong_buffer_filtered_band2, 1024);
		arm_biquad_cascade_df2T_f32(&instFilter3, buffer_float_sram, prev_pong_buffer_filtered_band3, 1024);
		// GPIO->P[gpioPortB].DOUT ^= (1<<9);
#ifdef PRE_PROCESSING_RMS 
		for(uint16_t i = 0; i < 1024; i++){
			*prev_ping_buffer_filtered_band1_bis++ = *prev_ping_buffer_filtered_band1++;
			*prev_ping_buffer_filtered_band2_bis++ = *prev_ping_buffer_filtered_band2++;
			*prev_ping_buffer_filtered_band3_bis++ = *prev_ping_buffer_filtered_band3++;
		}
#endif
#ifdef WITH_MAX_NOT_IN_INFERENCE
#ifdef PRE_PROCESSING_MAX
// GPIO->P[gpioPortB].DOUT ^= (1<<9);
			arm_abs_f32 (prev_pong_buffer_filtered_band1, prev_pong_buffer_filtered_band1, 1024);
			arm_abs_f32 (prev_pong_buffer_filtered_band2, prev_pong_buffer_filtered_band2, 1024);
			arm_abs_f32 (prev_pong_buffer_filtered_band3, prev_pong_buffer_filtered_band3, 1024);
			// GPIO->P[gpioPortB].DOUT ^= (1<<9);
#endif
		for(uint8_t i = 0; i < 8; i++){
#ifdef PRE_PROCESSING_RMS 
			/* RMS on previous and current buffer with hop length of 128 */
			arm_rms_f32(prev_pong_buffer_filtered_band1+(128*i), 1024, ptr_result_rms);
			*tmp_ptr_envelope1++ = result_rms;
			// envelope_1[count_env] = result_rms;
			arm_rms_f32(prev_pong_buffer_filtered_band2+(128*i), 1024, ptr_result_rms);
			*tmp_ptr_envelope2++ = result_rms;
			// envelope_2[count_env] = result_rms;
			arm_rms_f32(prev_pong_buffer_filtered_band3+(128*i), 1024, ptr_result_rms);
			*tmp_ptr_envelope3++ = result_rms;
			// envelope_3[count_env] = result_rms;
#endif
#ifdef PRE_PROCESSING_MAX
// GPIO->P[gpioPortB].DOUT ^= (1<<9);
			arm_max_f32(prev_pong_buffer_filtered_band1+(128*i), 128, max_pool_for_low_pass1+count_env, indexMax1);
			arm_max_f32(prev_pong_buffer_filtered_band2+(128*i), 128, max_pool_for_low_pass1+count_env, indexMax2);
			arm_max_f32(prev_pong_buffer_filtered_band3+(128*i), 128, max_pool_for_low_pass1+count_env, indexMax3);
			// GPIO->P[gpioPortB].DOUT ^= (1<<9);
#endif
			count_env++;
			if(count_env >= 80) {
#ifdef PRE_PROCESSING_MAX
				// GPIO->P[gpioPortB].DOUT ^= (1<<9);
				arm_biquad_cascade_df2T_f32(&instFilter_low1, max_pool_for_low_pass1, tmp_ptr_envelope1, 80);
				arm_biquad_cascade_df2T_f32(&instFilter_low2, max_pool_for_low_pass2, tmp_ptr_envelope2, 80);
				arm_biquad_cascade_df2T_f32(&instFilter_low3, max_pool_for_low_pass3, tmp_ptr_envelope3, 80);
				// GPIO->P[gpioPortB].DOUT ^= (1<<9);
#endif
				// envelop_ping_rdy = false;
				count_env = 0;
				SetEvent(inference, ev_NORMALIZE);
			}
		}
#endif	
		if(sram_ping_rdy){
			// GPIO->P[gpioPortB].DOUT &= ~(1<<9);
			arm_abs_f32 (prev_pong_buffer_filtered_band1, ptr_SRAM_FILTERED_AUDIO_PING_1+(count_env*1024), 1024);
			arm_abs_f32 (prev_pong_buffer_filtered_band2, ptr_SRAM_FILTERED_AUDIO_PING_2+(count_env*1024), 1024);
			arm_abs_f32 (prev_pong_buffer_filtered_band3, ptr_SRAM_FILTERED_AUDIO_PING_3+(count_env*1024), 1024);
			count_env++;
			if(count_env >= 10){
				// sram_ping_rdy = true;
				index_buffer_audio_inference = count_ptr_buffer;
				count_env = 0;
				SetEvent(inference, ev_NORMALIZE);
			}
		}
		else{
			// GPIO->P[gpioPortB].DOUT &= ~(1<<9);
			arm_abs_f32 (prev_pong_buffer_filtered_band1, ptr_SRAM_FILTERED_AUDIO_PONG_1+(count_env*1024), 1024);
			arm_abs_f32 (prev_pong_buffer_filtered_band2, ptr_SRAM_FILTERED_AUDIO_PONG_2+(count_env*1024), 1024);
			arm_abs_f32 (prev_pong_buffer_filtered_band3, ptr_SRAM_FILTERED_AUDIO_PONG_3+(count_env*1024), 1024);
			count_env++;
			if(count_env >= 10){
				// sram_ping_rdy = false;
				index_buffer_audio_inference = count_ptr_buffer;
				count_env = 0;
				SetEvent(inference, ev_NORMALIZE);
			}
		}
	}

	count_ptr_buffer++;
	if(count_ptr_buffer == 60) count_ptr_buffer = 0;

	// GPIO->P[gpioPortB].DOUT &= ~(1<<10);
	ChainTask(copyDMAtoSRAM);
}
#define APP_Task_copyDMAtoSRAM_STOP_SEC_CODE
#include "tpl_memmap.h"

#define APP_Task_start_sdcard_START_SEC_CODE
#include "tpl_memmap.h"

static void setTime(uint32_t time, uint32_t milliseconds) {
	/* 1024 tick per seconds */
    uint32_t ticks = ROUNDED_DIV(1024 * milliseconds, 1000);
    uint64_t intendedCounter = 1024 * (uint64_t)time + ticks;
    uint64_t offset = intendedCounter - (uint64_t)BURTC_CounterGet();
    BURTC_RetRegSet(1, (uint32_t)(offset >> 32));
    BURTC_RetRegSet(0, (uint32_t)(offset & 0xFFFFFFFF));
    BURTC_RetRegSet(2, 0x11223344);
	return;
}

static void getTime(uint32_t *time, uint32_t *milliseconds) {

    uint64_t offset =  (uint64_t)BURTC_RetRegGet(1) << 32;
    offset += (uint64_t)BURTC_RetRegGet(0);
    uint64_t currentCounter = offset + BURTC_CounterGet();

    if (time != NULL) {
        *time = currentCounter / 1024;
    }

    if (milliseconds != NULL) {
        uint32_t ticks = currentCounter % 1024;
        *milliseconds = ROUNDED_DIV(1000 * ticks, 1024);
    }
	return;
}

static void handleTimeOverflow(void) {
    uint32_t offsetHigh = BURTC_RetRegGet(1);
    BURTC_RetRegSet(1, offsetHigh + 1);
}

/* Time function for FAT file system */
DWORD get_fattime(void) {

    int8_t timezoneHours = 0;

    int8_t timezoneMinutes = 0;

    uint32_t currentTime;

    getTime(&currentTime, NULL);

    if (BURTC_IntGet() & BURTC_IF_OF) {
        handleTimeOverflow();
        getTime(&currentTime, NULL);
        BURTC_IntClear(BURTC_IF_OF);
    }

    time_t fatTime = currentTime + timezoneHours * 60 * 60 + timezoneMinutes * 60;

    struct tm timePtr;
	// return 0;
    gmtime_r(&fatTime, &timePtr);

    return (((unsigned int)timePtr.tm_year - 208) << 25) |
            (((unsigned int)timePtr.tm_mon + 1 ) << 21) |
            ((unsigned int)timePtr.tm_mday << 16) |
            ((unsigned int)timePtr.tm_hour << 11) |
            ((unsigned int)timePtr.tm_min << 5) |
            ((unsigned int)timePtr.tm_sec >> 1);
}


TASK(start_sdcard){
	GPIO_PinModeSet(gpioPortD, 12, gpioModePushPull, 1);
	/* Turn on SD card (PortD 12)*/
	GPIO_PinOutClear(gpioPortD, 12);
	/* Init */
	MICROSD_Init();
	/* Check SD card status */
	DSTATUS resCard = disk_initialize(0);
	if (resCard == STA_NOINIT || resCard == STA_NODISK || resCard == STA_PROTECT) {
        while(1);
    }
    /* Initialise file system */
    if (f_mount(&fatfs, "", 1) != FR_OK) {
        while(1);
    }

