bernabeu-a/trampoline/examples/cortex/armv7em/efm32wg/audiomoth/yellow_hammer_audiomoth_test/main.c
	// f_open(&fileaudio, "audio.wav", FA_OPEN_APPEND | FA_WRITE);
	// f_write(&fileaudio, &wavHeader, sizeof(wavHeader_t), &bw);
	// f_close(&fileaudio);

	// f_open(&fileaudio, "test.wav", FA_OPEN_APPEND | FA_WRITE);
	// f_write(&fileaudio, &wavHeader, sizeof(wavHeader_t), &bw);
	// f_close(&fileaudio);
	/* Debug */

	TerminateTask();

}
#define APP_Task_start_sdcard_STOP_SEC_CODE
#include "tpl_memmap.h"

#define APP_Task_write_audio_START_SEC_CODE
#include "tpl_memmap.h"

void update_timekeeper(void){
	timekeeper.unix_timestamp++;
}

// void timekeeper_fron_unix(void){
// 	uint32_t temp_timestamp = timekeeper.unix_timestamp;
// 	timekeeper.days = temp_timestamp / 86400;
// 	temp_timestamp %= 86400;
// 	timekeeper.hours = temp_timestamp / 3600;
// 	temp_timestamp %= 3600;
// 	timekeeper.minutes = temp_timestamp / 60;
// 	timekeeper.seconds = temp_timestamp % 60;
// }

uint8_t modulo(uint8_t a, uint8_t b){
	int8_t r  = a % b;
	return r < 0 ? r + b: r;
}
TASK(write_audio){
	/* We are here from inference hit */
	// GPIO->P[gpioPortA].DOUT |= (1<<7);

	/* First set writting_variable */
	index_buffer_audio_to_write = 0;
	is_writting_audio = 1;
	/* Create a file */
	char *filename;
	char filename_buffer[15];
	/* Count number of digit in timestamp for offset extension of file */
	uint8_t count_digit = 0;
	uint32_t tmp_timestamp = timekeeper.unix_timestamp;
    while(tmp_timestamp>0){
        count_digit++;
        tmp_timestamp = tmp_timestamp/10;
    }

	filename = __itoa(timekeeper.unix_timestamp, filename_buffer, 10);
	strcpy(filename+count_digit, ".wav");
	GPIO->P[gpioPortB].DOUT |= 1<<10;
	f_open(&fileaudio, filename, FA_OPEN_APPEND | FA_WRITE);
	GPIO->P[gpioPortB].DOUT &= ~(1<<10);
	f_write(&fileaudio, &wavHeader, sizeof(wavHeader_t), &bw);
	/* Current audio buffer to write is count_ptr_buffer */
	/* First write previous buffers */
	// uint8_t read_count_ptr_buffer = ((count_ptr_buffer-20) % 40);
	uint8_t tmp_count_ptr_buffer = index_buffer_audio_inference2;
	uint8_t read_count_ptr_buffer;
	if(tmp_count_ptr_buffer > 40){
		read_count_ptr_buffer = tmp_count_ptr_buffer - 40;
	}
	else{
		read_count_ptr_buffer = tmp_count_ptr_buffer + 20;
	}
	// uint8_t read_count_ptr_buffer = modulo((tmp_count_ptr_buffer-20),  40);
	uint8_t endwhile = tmp_count_ptr_buffer;
	// if(read_count_ptr_buffer == 20) read_count_ptr_buffer = 0;
	while(read_count_ptr_buffer != endwhile){
		f_write(&fileaudio, buffer_ptr_sram[read_count_ptr_buffer], 2*1024, &bw);
		read_count_ptr_buffer++;
		if(read_count_ptr_buffer == 60) read_count_ptr_buffer = 0;
	}
	/* Now write next 2s of sound */
	uint8_t count_write_audio_post_inference = 0;
	while(count_write_audio_post_inference != 40){
		uint8_t test_index = index_buffer_audio_to_write;
		EventMaskType ev_wr;
		WaitEvent(ev_write_audio);
		GetEvent(write_audio, &ev_wr); 
		ClearEvent(ev_wr);
		GPIO->P[gpioPortA].DOUT |= (1<<7);
		f_write(&fileaudio, buffer_ptr_sram2[test_index], 2*1024, &bw);
		count_write_audio_post_inference++;
		GPIO->P[gpioPortA].DOUT &= ~(1<<7);
	}
	is_writting_audio = 0;
	f_close(&fileaudio);
	TerminateTask();
}
#define APP_Task_write_audio_STOP_SEC_CODE
#include "tpl_memmap.h"

#define APP_ISR_isr_dma_START_SEC_CODE
#include "tpl_memmap.h"
ISR(isr_dma){
	/* Get interrupt mask */
	uint32_t interruptMask = DMA_IntGet();
	if(interruptMask == DMA_IF_CH0DONE){
		/* Clear interrupt */
		DMA_IntClear(DMA_IFC_CH0DONE);
		isPrimaryDMABuffer = !isPrimaryDMABuffer;
		/* Re-activate the DMA */
    	DMA_RefreshPingPong(0,
        	isPrimaryDMABuffer,						/* bool to change between dma descriptor, primaryBuffer or secondaryBuffer DST*/
        	false,
        	NULL,									/* dst : NULL = same as in descriptor, thus same as in start dma TASK, (void*)primaryBuffer or (void*)secondaryBuffer */
        	NULL,									/* src : NULL = same as in descriptor, thus same as in start dma TASK, (void*)&(ADC0->SINGLEDATA) */
        	numberOfSamplesPerTransfer - 1,
        	false);
		SetEvent(copyDMAtoSRAM, ev_DMAtoSRAM);
	}
	else if (interruptMask == DMA_IF_CH1DONE){
		/* nothing to do on DMA ch 1 ? */
	}
}
#define APP_ISR_isr_dma_STOP_SEC_CODE
#include "tpl_memmap.h"

#define APP_ISR_isr_rtc_START_SEC_CODE
#include "tpl_memmap.h"
ISR(isr_rtc){
	// GPIO->P[gpioPortB].DOUT ^= (1<<9);
	RTC_IntClear(RTC_IF_COMP0);
	RTC_CounterReset();
	update_timekeeper();
	RTC_CompareSet(0, 32768);
}
#define APP_ISR_isr_rtc_STOP_SEC_CODE
#include "tpl_memmap.h"